<font size=6> DataFrame vs SQL

# Data Load

In [1]:
import pandas as pd
import numpy as np

In [2]:
emp = pd.read_csv("./lec08_emp.csv", parse_dates=['HIREDATE'])
emp.head(3)

   EMPNO  ENAME       JOB     MGR   HIREDATE   SAL   COMM  DEPTNO
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

컬럼이름 소문자 변경

In [3]:
emp.columns = emp.columns.str.lower()
# #emp.columns = ['empno', 'ename', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno']

In [4]:
emp.head()

   empno   ename       job     mgr   hiredate   sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30

# select

## <font color=red size=6><b>df[</b></font> 컬럼            <font color=red><b>]</b></font></b></font>, <font size=6 color=red><b>df[</b></font> [컬럼1, 컬럼2]  <font color=red><b>]</b></font></b></font><br>

select * from emp;

In [5]:
emp

    empno   ename        job     mgr   hiredate   sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

select ename from emp;

In [6]:
emp['ename']

0      SMITH
1      ALLEN
2       WARD
3      JONES
4     MARTIN
5      BLAKE
6        CCC
7      SCOTT
8       KING
9     TURNER
10     ADAMS
11     JAMES
12      FORD
13    MILLER
Name: ename, dtype: object

select empno, ename from emp;

In [7]:
emp[ ['empno','ename'] ]

    empno   ename
0    7369   SMITH
1    7499   ALLEN
2    7521    WARD
3    7566   JONES
4    7654  MARTIN
5    7698   BLAKE
6    7782     CCC
7    7788   SCOTT
8    7839    KING
9    7844  TURNER
10   7876   ADAMS
11   7900   JAMES
12   7902    FORD
13   7934  MILLER

*<font color=red><b>  loc[줄, 칸] : 값으로 꺼내기</font> <br>
*<font color=red><b> iloc[줄, 칸] : 인덱스로 꺼내기 </font>
* [줄, 칸]
    - 단일값
    - [단일값, 단일값, 단일값]
    - 슬라이싱[ : ]

## <font size=6 color=red><b>df.iloc[줄idx, 칸idx]</b></font>

In [8]:
emp.iloc[0]  #줄 단일값

empno                      7369
ename                     SMITH
job                       CLERK
mgr                      7902.0
hiredate    1980-12-17 00:00:00
sal                         800
comm                        NaN
deptno                       20
Name: 0, dtype: object

In [9]:
emp.iloc[  [0,1]  ]  #줄 [단일값, 단일값, 단일값]

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30

In [10]:
emp.iloc[  [0,3,5]  ]  # 줄 [단일값, 단일값, 단일값]

   empno  ename      job     mgr   hiredate   sal  comm  deptno
0   7369  SMITH    CLERK  7902.0 1980-12-17   800   NaN      20
3   7566  JONES  MANAGER  7839.0 1981-04-02  2975   NaN      20
5   7698  BLAKE  MANAGER  7839.0 1981-05-01  2850   NaN      30

In [11]:
emp.iloc[0 , 0]   # 줄 단일값 ,  칸 단일값

7369

In [12]:
emp.iloc[0 , [0,1] ] # 줄 단일값 ,  칸 [단일값, 단일값, 단일값]

empno     7369
ename    SMITH
Name: 0, dtype: object

In [13]:
emp.iloc[ [0,1,2] , [0,1] ] # 줄 [단일값, 단일값, 단일값] ,  칸 [단일값, 단일값, 단일값]

   empno  ename
0   7369  SMITH
1   7499  ALLEN
2   7521   WARD

In [14]:
emp.iloc[ 0:3  ] #줄 슬라이싱

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

In [15]:
emp.iloc[ 0:3 ,  1:4 ] #줄 슬라이싱  칸 슬라이싱

   ename       job     mgr
0  SMITH     CLERK  7902.0
1  ALLEN  SALESMAN  7698.0
2   WARD  SALESMAN  7698.0

In [16]:
emp.iloc[ [0,2,5] ,  1:4 ] #줄 [단일값, 단일값, 단일값]  칸 슬라이싱

   ename       job     mgr
0  SMITH     CLERK  7902.0
2   WARD  SALESMAN  7698.0
5  BLAKE   MANAGER  7839.0

## <font size=6 color=red><b>df.loc [줄값, 칸값]</b></font>
* 줄값 : index 값

In [17]:
emp.loc[ [1,2,3],  'empno' ]

1    7499
2    7521
3    7566
Name: empno, dtype: int64

In [18]:
emp.loc[ [1,2,3],  ['empno','ename']   ]

   empno  ename
1   7499  ALLEN
2   7521   WARD
3   7566  JONES

<font color=red><b> loc으로 슬라이싱 시 미만이 아니다 - 주의주의주의!!!<br>
'empno':'mgr' 라고 하면 mgr도 포함된다

In [19]:
emp.loc[ 0:3,  'empno':'mgr']  #주의주의주의

   empno  ename       job     mgr
0   7369  SMITH     CLERK  7902.0
1   7499  ALLEN  SALESMAN  7698.0
2   7521   WARD  SALESMAN  7698.0
3   7566  JONES   MANAGER  7839.0

In [20]:
emp.loc[ [1,2,3,4], ['job','mgr','hiredate']]

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

In [21]:
emp.loc[ 1:4, 'job':'hiredate']

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

In [22]:
emp.iloc[ 1:5, 2:5]

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

In [23]:
emp.iloc[ [1,2,3,4],  [2,3,4]]

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

# where조건
<font size=6 color=red><b>df[</b></font> 컬럼<font size=6 color=red><b>]</b></font><br>
<font size=6 color=red><b>df[</b></font> 조건<font size=6 color=red><b>]</b></font><br>
<font size=6 color=red><b>df[</b></font> 조건<font size=6 color=red><b>]</b></font><font size=6 color=red><b>[</b></font> 컬럼<font size=6 color=red><b>]</b></font><br>
<font size=6 color=red><b>df[</b></font> 컬럼<font size=6 color=red><b>]</b></font><font size=6 color=red><b>[</b></font> 조건<font size=6 color=red><b>]</b></font>

select * from emp where depnto = 10

In [24]:
emp[ emp['deptno']==10 ]

    empno   ename        job     mgr   hiredate   sal  comm  deptno
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450   NaN      10
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000   NaN      10
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300   NaN      10

select empno, ename from emp where depnto = 10

In [25]:
emp[ emp['deptno']==10 ] [ ['empno','ename'] ]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

In [26]:
emp [ ['empno','ename'] ] [ emp['deptno']==10 ]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

# 멀티 조건
* <font color=red size=6><b>df[컬럼] [ ( (조건)  &  (조건) )  |  (조건) ]</b></font> 
* df[] [ ()  &  ()  &  () ] 
* and --> &
* or  --> |
* 조건은 반드시 괄호로 묶어라

select empno, ename,sal from emp where deptno=10 and sal>2000;

In [32]:
#df[컬럼 ][ 조건 ]  -단일조건은 그냥 조건
#df[  [컬럼,컬럼]  ][  (조건)  & (조건) ]  -멀티조건은 반드시 (조건)

emp[ ['empno','ename','sal']  ] [  emp['deptno']==10  ]                       #단일조건
emp[ ['empno','ename','sal']  ] [  (emp['deptno']==10) & (emp['sal']>2000)  ] #멀티조건 반드시 (조건)

   empno ename   sal
6   7782   CCC  2450
8   7839  KING  5000

# subquery 비추

* 사번이 7369인 사원의 직업과 같은 사원들의 이름, 직업 출력

* select job from emp where empno=7369;  

* select ename, job from emp where job = 'CLERK';

* select ename, job
from emp
where job = (select job from emp where empno=7369);

In [37]:
# select job from emp where empno=7369;
job7369 = emp['job'] [ emp['empno']==7369 ].values[0]
job7369

'CLERK'

In [38]:
# select ename, job from emp where job = 'CLERK';
emp [ ['ename','job' ]] [ emp['job']=='CLERK' ]

     ename    job
0    SMITH  CLERK
10   ADAMS  CLERK
11   JAMES  CLERK
13  MILLER  CLERK

In [41]:
# emp [ ['ename','job' ]] [ emp['job']== emp['job'] [ emp['empno']==7369 ].values[0]]
emp [ ['ename','job' ]] [ emp['job']==job7369]

     ename    job
0    SMITH  CLERK
10   ADAMS  CLERK
11   JAMES  CLERK
13  MILLER  CLERK

10번부서 사람들의 직업과 같은 사원의 사원들의 이름, 직업 출력
* select job from emp where deptno=10;  -- 서브쿼리 결과가 여러건
* select ename, job from emp where job in ('MANAGER','PRESIDENT','CLERK');
* select ename, job from emp where job in (select job from emp where deptno=10);

In [54]:
# select job from emp where deptno=10; 
job10_arr = emp['job'] [ emp['deptno']==10].values
print( job10_arr )

['MANAGER' 'PRESIDENT' 'CLERK']

In [51]:
# select ename, job from emp where job in ('MANAGER','PRESIDENT','CLERK');
emp[  ['ename','job'] ] [  emp['job'].isin(['MANAGER','PRESIDENT','CLERK']) ]

     ename        job
0    SMITH      CLERK
3    JONES    MANAGER
5    BLAKE    MANAGER
6      CCC    MANAGER
8     KING  PRESIDENT
10   ADAMS      CLERK
11   JAMES      CLERK
13  MILLER      CLERK

In [55]:
# select ename, job from ep where job in (select job from emp where deptno=10);
emp[  ['ename','job'] ] [  emp['job'].isin( job10_arr ) ]

     ename        job
0    SMITH      CLERK
3    JONES    MANAGER
5    BLAKE    MANAGER
6      CCC    MANAGER
8     KING  PRESIDENT
10   ADAMS      CLERK
11   JAMES      CLERK
13  MILLER      CLERK

# 컬럼연산

* 컬럼 합치기
* select job||ename from emp;
* select concat(job, ename) from emp;

In [72]:
# emp['sal'] + emp['ename'] --타입이 달라서 덧셈연산 불가

In [56]:
emp['job'] + emp['ename']

0         CLERKSMITH
1      SALESMANALLEN
2       SALESMANWARD
3       MANAGERJONES
4     SALESMANMARTIN
5       MANAGERBLAKE
6         MANAGERCCC
7       ANALYSTSCOTT
8      PRESIDENTKING
9     SALESMANTURNER
10        CLERKADAMS
11        CLERKJAMES
12       ANALYSTFORD
13       CLERKMILLER
dtype: object

* select sal, sal*12 as asal from emp;

In [69]:
emp['asal'] = emp['sal'] * 12

In [70]:
emp.head(3)

   empno  ename       job     mgr   hiredate   sal   comm  deptno   asal
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20   9600
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30  19200
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30  15000

# 결측처리
* df.dropna()
* df['comm'].filna(0)  ---------- nvl(comm, 0)
* emp['comm'].isna()   ----------  where comm is null

select comm , nvl(comm,0) as comm2 from emp;

In [78]:
emp['comm2'] = emp['comm'].fillna(0)
emp[['comm', 'comm2']].head(3)

    comm  comm2
0    NaN    0.0
1  300.0  300.0
2  500.0  500.0

# 그룹
*그룹함수 : mean() max() min() count() sum() std()  
<font color=red size=6><b>df.groupby(</b></font>컬럼 <font color=red size=6><b>)</b></font> ['deptno']<font color=red size=6><b>.count()</b></font>

각 부서별 사원수 출력  
select deptno, count(empno) from emp group by deptno;

In [83]:
emp.groupby("deptno").first()

        empno  ename       job     mgr   hiredate   sal   comm   asal  comm2
deptno
10       7782    CCC   MANAGER  7839.0 1981-06-09  2450    NaN  29400    0.0
20       7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN   9600    0.0
30       7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0  19200  300.0

In [86]:
emp.groupby("deptno")['deptno'].count()

deptno
10    3
20    5
30    6
Name: deptno, dtype: int64

각 부서별 급여 합  
select deptno, sum(sal) from emp group by deptno;

In [88]:
emp.groupby('deptno')['sal'].sum()

deptno
10     8750
20    10875
30     9400
Name: sal, dtype: int64

부서별 최대 최소 급여  
select  deptno, max(sal), min(sal) from emp group by deptno;

In [92]:
emp.groupby("deptno")['sal'].min()
emp.groupby("deptno")['sal'].max()

deptno
10    1300
20     800
30     950
Name: sal, dtype: int64

In [93]:
emp.groupby("deptno").agg(  {"sal":"max",  "comm":"min"}   )

         sal  comm
deptno
10      5000   NaN
20      3000   NaN
30      2850   0.0

In [95]:
# dict안에 sal 키값이 중복되어 에러
# emp.groupby("deptno").agg(  {"sal":"max",  "sal":"min"}   ) 

# 컬럼을 밖으로 빼고.agg(  [그룹함수, 그룹함수]  )
emp.groupby("deptno")['sal'].agg(  ['max','min']  )

         max   min
deptno
10      5000  1300
20      3000   800
30      2850   950

각 부서별 급여 합, 최대, 최소, 평균  
select deptno, sum(sal), max(sal), min(sal), avg(sal) from emp

In [102]:
# emp.groupby('deptno')['sal'].count()
emp.groupby('deptno')['sal'].agg( ['sum','max','min','mean', 'count', 'std', 'var'] )

          sum   max   min         mean  count          std           var
deptno
10       8750  5000  1300  2916.666667      3  1893.629672  3.585833e+06
20      10875  3000   800  2175.000000      5  1123.332097  1.261875e+06
30       9400  2850   950  1566.666667      6   668.331255  4.466667e+05